index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Terminal: Friendlier than it seems</title>
<meta name="author" content="Luis Gascon"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/black.css" id="theme"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/plugin/highlight/zenburn.css"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Terminal: Friendlier than it seems</h1><h2 class="author">Luis Gascon</h2>
</section>
<aside class="notes">
<p>
My name&rsquo;s Luis Gascon. I want to share my workflow and the tools that I love in the command line to break the myth that you have to be an advanced computer user to use it.
</p>

<p>
I recently switched over to a Macbook because the M1 is too good to pass. I&rsquo;m still uncomfortable with MacOS and it&rsquo;s weird quirks but thanks to its UNIX shell, I felt right at home and was able to get things done.
</p>

</aside>

<section>
<section id="slide-orge4df4d9">
<h2 id="orge4df4d9">It&rsquo;s 2023. Why do terminals still exist?</h2>
<p>
The command line doesn&rsquo;t look modern. Are you trying to be a try hard?
No. It does come with many benefits
Learning how to use the command line opens up a new avenue to using computers.
</p>
</section>
<section id="slide-orgbc43723">
<h3 id="orgbc43723">Automation</h3>
<p>
You can easily automate manual tasks with text compared to clicking buttons around
</p>

<p>
The power to chain commands together is so powerful, people get paid to do it 😎
</p>
</section>
<section id="slide-orgf4b17ed">
<h3 id="orgf4b17ed">It&rsquo;s the only way to use certain software</h3>
<p>
Many open source applications are only built to be interacted with the terminal. Some have GUIs made for it, but it takes considerable effort to do so and if you&rsquo;ve played around with some, it&rsquo;s janky and slow.
</p>
</section>
<section id="slide-orgecbf997">
<h3 id="orgecbf997">Blazingly fast</h3>
<p>
If it&rsquo;s written in rust&#x2026;
</p>


</section>
</section>
<section>
<section id="slide-orgf29f195">
<h2 id="orgf29f195">Note for Windows users&#x2026;</h2>
<p>
I&rsquo;m no Windows expert, but from experience, cmd.exe is trash, and I don&rsquo;t recommend on using it.
Unsure if it comes by default but Windows has a terminal emulator called &ldquo;Windows Terminal&rdquo; that can deal with it
</p>
</section>
</section>
<section>
<section id="slide-org1feaf25">
<h2 id="org1feaf25">She sells sea <code>shell</code> s by the sea shore</h2>
<p>
A shell is the program that interprets the commands that you input.
By default,
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">OS</th>
<th scope="col" class="org-left">Default shell</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MacOS</td>
<td class="org-left">zsh</td>
</tr>

<tr>
<td class="org-left">Windows</td>
<td class="org-left">powershell</td>
</tr>

<tr>
<td class="org-left">Linux</td>
<td class="org-left">bash</td>
</tr>
</tbody>
</table>

<p>
MacOS ships with zsh,
most Linux distributions come with bash,
Windows with powershell
</p>

<p>
The beauty of it is that you can always change it
You can think of a shell like the Python interpreter
</p>
</section>
</section>
<section>
<section id="slide-orgb836ab0">
<h2 id="orgb836ab0">Navigation</h2>
<ul>
<li><code>ls</code>
<ul>
<li>Take a peek at current directory or at a specified location</li>

</ul></li>
<li><code>cd</code>
<ul>
<li>Change directory. This allows</li>

</ul></li>
<li><code>ranger</code>
<ul>
<li>Isn&rsquo;t shipped by default but it makes terminal navigation much more intuitive and visual</li>
<li>To install ranger, we&rsquo;ll have to know about package managers, which I&rsquo;ll cover in a bit</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-org28fe6bc">
<h2 id="org28fe6bc">Working with files</h2>
<ul>
<li><code>mv</code></li>
<li><code>cat</code></li>
<li><code>rm</code></li>

</ul>
</section>
</section>
<section>
<section id="slide-org8c41810">
<h2 id="org8c41810">What are flags?</h2>
<p>
Flags modify how a program behaves.
For example, when you pass a <code>-a</code> flag to <code>ls</code>, it will also include hidden files, A.K.A dotfiles since they start with dots
</p>
</section>
</section>
<section>
<section id="slide-orga25efa6">
<h2 id="orga25efa6">Package managers</h2>
<p>
Imagine clicking buttons to install a program when you could look like this:
&lt;Insert chad using a terminal&gt;
</p>

<p>
A package manager downloads, installs, uninstalls and automagically configures your system to be able to run the command that you want to install.
</p>

</section>
<section id="slide-org62be634">
<h3 id="org62be634">Windows</h3>
<ul>
<li>Scoop
<ul>
<li>Installs packages within the current user&rsquo;s directory so it doesn&rsquo;t mess</li>
<li>Since it</li>
<li>My preferred package manager for windows</li>

</ul></li>
<li>Chocolatey</li>

</ul>
</section>
<section id="slide-org7770b14">
<h3 id="org7770b14">MacOS</h3>
<ul>
<li>Brew
<ul>
<li>The de facto package manager for MacOS</li>
<li>Many popular packages may be found here</li>

</ul></li>
<li>MacPorts</li>
<li>Nix
<ul>
<li>This package manager is great if you&rsquo;re up for a challenge!</li>

</ul></li>

</ul>
</section>
<section id="slide-org2e7f8e9">
<h3 id="org2e7f8e9">Linux</h3>
<ul>
<li>Depends on the distribution, so I&rsquo;m not about to list all of them</li>

</ul>

</section>
</section>
<section>
<section id="slide-org3f03ab5">
<h2 id="org3f03ab5">How to make the terminal more <i>aesthetic</i> and <i>functional</i></h2>
<p>
You&rsquo;re not constraint to a boring black screen with lines of text strewn across it
There are a myriad of open source tools that can turn make the terminal experience significantly more pleasant.
</p>
</section>
<section id="slide-orged3703a">
<h3 id="orged3703a">Custom Prompts</h3>
<ul>
<li><a href="https://starship.rs">Starship</a>
<ul>
<li>Provides convenient information depending on the context of your current directory such as what type of files are in the</li>

</ul></li>

</ul>
</section>
<section id="slide-org6f0dce5">
<h3 id="org6f0dce5">Alternatives to common commands</h3>
<p>
Open source is beautiful in that you can try out alternatives to the commands that we just learned about
Some add more functionality, and some are more performant.
</p>
<ul>
<li><a href="https://github.com/sharkdp/fd">fd</a>
<ul>
<li>An alternative to the find command. Very handy when you can&rsquo;t find a certain file</li>

</ul></li>
<li><a href="https://github.com/BurntSushi/ripgrep">rg</a>
<ul>
<li>Stands for rip grep, which looks for patterns within files so if you can&rsquo;t remember which file has the keyword &ldquo;hello world&rdquo;, it&rsquo;ll tell you where it&rsquo;s located and which line in the file it&rsquo;s located.</li>

</ul></li>
<li></li>

</ul>
</section>
<section id="slide-orge22eb23">
<h3 id="orge22eb23">Text editors</h3>
<p>
If you want to stay in the terminal, there are multiple text editors that can be as powerful as GUI-based text editors such as VSCode, and definitely more than Dr. Java 🤮
</p>
<ul>
<li><a href="https://neovim.io">Neovim</a></li>
<li><a href="https://helix-editor.com">Helix</a>
<ul>
<li>A modal text editor similar to Vim but with a twist. LSP support is included out of the box, so as long as you have the LSP installed, you can be up and running in no time</li>

</ul></li>
<li>Emacs</li>

</ul>
</section>
</section>
<section>
<section id="slide-org3e187f4">
<h2 id="org3e187f4">Trivia</h2>
<div class="outline-text-2" id="text-org3e187f4">
</div>
</section>
<section id="slide-orgb65ab36">
<h3 id="orgb65ab36">Where did I put it?</h3>
<p>
You saved a recipe that your mother gave you as a text file somewhere within your home directory, but you can&rsquo;t remember where you saved it. You can&rsquo;t recall the title but you remember it had the words &ldquo;Tomato&rdquo; in the file. What do you do?
</p>
<ol>
<li>Search through all the text files within your home directory one by one</li>
<li>Use either <code>fd</code> or <code>find</code> command</li>
<li>Use either <code>grep</code> or <code>rg</code> command</li>
<li>Ask your mom for the recipe again</li>

</ol>
</section>
<section id="slide-org145ad13">
<h3 id="org145ad13">Getting ready for class</h3>
<p>
On the first day of your programming class, your professor asks you to install Java but they make you remotely log in to a Debian Linux server on campus and it doesn&rsquo;t have a GUI. What command do you enter?
</p>
<ol>
<li><code class="src src-bash"><span style="color: #721045;">scoop</span> install java</code></li>
<li><code class="src src-bash"><span style="color: #721045;">apt</span> install java</code></li>
<li><code class="src src-bash"><span style="color: #721045;">brew</span> install java</code></li>
<li><code class="src src-bash"><span style="color: #721045;">install</span> dr.Java</code></li>

</ol>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/highlight/highlight.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,
overview: true,

transition: 'convex',
transitionSpeed: 'default',

// Plugins with reveal.js 4.x
plugins: [ RevealHighlight ],

// Optional libraries used to extend reveal.js
dependencies: [
]

});
</script>
</body>
</html>
